app/controllers/todos_controller.rb

  def index
    # these two at the top because they both return an ActiveRecord Object
    @todos = Todo.where(:user_id => current_user.id)
    @todos = @todos.paginate(:page => params[:page], :per_page => 5)

    # the following returns an Array
    @todos = @todos.find(:all, :include => :category, :order => "categories.priority")
---
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = 1 AND "todos"."id" = 0
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = 1 LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "todos" WHERE "todos"."user_id" = 1
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = 1 AND "todos"."include" = 'categories' AND "todos"."order" = 'categories.priority ASC' LIMIT 5 OFFSET 0

  def create
    params[:todo][:user_id] = current_user.id
    @todo = Todo.new(params[:todo].except(:category))

    handle_category(params)

    respond_to do |format|
      if @todo.save
---
INSERT INTO "categories" ("created_at", "name", "priority", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 24 May 2013 07:55:23 UTC +00:00], ["name", "hello"], ["priority", 1], ["updated_at", Fri, 24 May 2013 07:55:23 UTC +00:00]]
INSERT INTO "todos" ("category_id", "content", "created_at", "deadline", "status", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @todo = Todo.find(params[:id])
    params[:todo][:user_id] = current_user.id
    respond_to do |format|
      if @todo.update_attributes(params[:todo].except(:category)) && @todo.category.update_attributes(params[:todo][:category])
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "categories" SET "name" = 'extremely important', "priority" = 1, "updated_at" = '2013-05-24 17:55:34.216105' WHERE "categories"."id" = 17
UPDATE "todos" SET "deadline" = '2013-05-26', "updated_at" = '2013-05-24 09:24:12.714675' WHERE "todos"."id" = 1